/*案例：百錢買百雞
 * 公雞 3塊錢/隻，母雞 2塊錢/隻，小雞 1塊錢2隻
 * 用一百塊錢買一百隻雞，各種雞都要有，共有哪幾種買法?
 * 公雞					母雞				小雞
 * 1						1						98
 * 1						2						97
 * 1						3						96
 * ..........
 * 1						49					50
 * --------------------------------第1輪
 * 2						1						97
 * 2						2						96
 * 2						3						95
 * .........
 * 2						49					49
 * --------------------------------第2輪
 * .........
 * --------------------------------第33輪
 * 33					1						66
 * ........
 * 33					49					18
 */
package chapter2;

public class ForDemo15
{
	public static void main(String[] args)
	{
		int i, j, k;  // i：公雞數   j：母雞數   k：小雞數
		for (i = 1; i <= 33; i++)
		{
			for (j = 1; j <= 49; j++)
			{
				k = 100 - i - j;
				if (k%2==0 && (3*i + 2*j + k/2)==100)
				{
					System.out.println("公雞的數目是："+i+"   母雞的數目是："+j+"   小雞的數目是："+k);
				}
			}
		}
	}
}
